---
kind: property
id: P:Autodesk.Revit.DB.FamilyParameter.Formula
source: html/3eed68c4-620a-c993-54b2-5e51f04b814c.htm
---
# Autodesk.Revit.DB.FamilyParameter.Formula Property

The formula.

## Syntax (C#)
```csharp
public string Formula { get; }
```

## Remarks
Returns Nothing nullptr a null reference ( Nothing in Visual Basic) if there is no formula governing this parameter.